DROP DATABASE IF EXISTS company;
CREATE DATABASE company;

USE company;

DROP TABLE IF EXISTS user;
CREATE TABLE user
(
  id bigint(20) unsigned NOT NULL AUTO_INCREMENT,
  code varchar(255) unique NOT NULL,
  name varchar(255) NOT NULL,
  name_kana varchar(255) NOT NULL,
  gender int(1) NOT NULL,
  created_at datetime NOT NULL DEFAULT CURRENT_TIMESTAMP,
  updated_at datetime NOT NULL DEFAULT CURRENT_TIMESTAMP ON
  UPDATE CURRENT_TIMESTAMP,
  PRIMARY KEY (id)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;


INSERT INTO user(code, name, name_kana, gender) VALUES
('1', '平川勇太', 'ひらかわゆうた', '1'),
('2', '磯村夏希', 'いそむらなつき', '2'),
('3', '池谷美佐子', 'いけたにみさこ', '2'),
('4', '曽我優', 'そがゆう', '2'),
('5', '児島未來', 'こじまみらい', '0'),
('6', '及川有海', 'おいかわあみ', '2'),
('7', '関根英嗣', 'せきねひでつぐ', '1'),
('8', '樋口真一', 'ひぐちしんいち', '1'),
('9', '柳沢俊二', 'やなぎさわしゅんじ', '1'),
('10', '田島蒼甫', 'たじまそうすけ', '1'),
('11', '川合礼子', 'かわいれいこ', '2'),
('12', '下山努', 'しもやまつとむ', '1'),
('13', '河西浩太郎', 'かわにしこうたろう', '1'),
('14', '小泉翔子', 'こいずみしょうこ', '2'),
('15', '渋谷正敏', 'しぶやまさとし', '0'),
('16', '真矢美月', 'まやみづき', '2'),
('17', '北川杏', 'きたがわあん', '2'),
('18', '宮川みき', 'みやかわみき', '2'),
('19', '滝田倫子', 'たきたのりこ', '2'),
('20', '若山隆之介', 'わかやまりゅうのすけ', '0'),
('21', '青山碧海', 'あおやまおうが', '1'),
('22', '城田友香', 'しろたともか', '2'),
('23', '杉村賢治', 'すぎむらけんじ', '1'),
('24', '今田浩正', 'いまだひろまさ', '0'),
('25', '大熊優', '	おおくまゆう', '2'),
('26', '赤羽ちえみ', 'あかばねちえみ', '2'),
('27', '山中綾', 'やまなかあや', '2'),
('28', '三田耕司', 'みたこうじ', '1'),
('29', '小室禄郎', 'こむろろくろう', '1'),
('30', '矢田ちえみ', 'やだちえみ', '2'),
('31', '寺本あき', 'てらもとあき', '2'),
('32', '重田一代', 'しげたかずよ', '0'),
('33', '滝沢麻由子', 'たきざわまゆこ', '2'),
('34', '関根倫子', 'せきねのりこ', '2'),
('35', '中園陽子', 'なかぞのようこ', '2'),
('36', '池本三郎', 'いけもとさぶろう', '1'),
('37', '山内貴嶺', 'やまうちたかね', '1'),
('38', '貫地谷あき', 'かんじやあき', '2'),
('39', '松山守', 'まつやままもる', '1'),
('40', '西浦コウ', 'にしうらこう', '1'),
('41', '矢島玲那', 'やじまれな', '2'),
('42', '大井沙耶', 'おおいさや', '2'),
('43', '羽田涼', 'はだりょう', '1'),
('44', '森下美佐', 'もりしたみさ', '2'),
('45', '阪本寿明', 'さかもととしあき', '1'),
('46', '相田雅之', 'あいだまさゆき', '1'),
('47', '金城美和子', 'かなしろみわこ', '2'),
('48', '高沢美佐', 'たかさわみさ', '2'),
('49', '奈良将也', 'ならまさや', '1'),
('50', '緒形芳正', 'おがたよしまさ', '1');
